{
  "project": "Ultra GitLab",
  "branchName": "ralph/approval-immediate-sync",
  "description": "Immediate Sync on Approval - Push approve/unapprove actions to GitLab immediately instead of waiting for the next 5-minute sync cycle",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add FlushApprovals command to sync engine",
      "description": "As a developer, I need the sync engine to support a new command that triggers immediate processing of approval-type actions only.",
      "acceptanceCriteria": [
        "Add a `FlushApprovals` variant to the `SyncCommand` enum in the sync engine",
        "When the sync engine receives `FlushApprovals`, it fetches only pending actions with action_type = 'approve' from the sync queue",
        "Each fetched approval action is processed using the existing `sync_processor::process_action` logic",
        "If no approval actions are pending, the flush is a no-op (no API calls made)",
        "Other queued action types (Comment, Reply, Resolve, Unresolve) are not processed during the flush",
        "The flush does not interfere with a currently-running full sync — commands are processed sequentially via the existing channel",
        "The regular 5-minute sync interval continues unchanged after a flush",
        "Typecheck passes (cargo check)"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Add filtered pending actions query to sync queue",
      "description": "As a developer, I need a way to query only approval-type pending actions from the sync queue so the flush can target them specifically.",
      "acceptanceCriteria": [
        "Add a function to sync_queue (e.g., `get_pending_actions_by_type`) that accepts an ActionType filter and returns only matching pending actions",
        "The function queries sync_queue WHERE status = 'pending' AND action_type = 'approve'",
        "Returns the same action struct format as the existing `get_pending_actions` function",
        "If no matching actions exist, returns an empty vec (not an error)",
        "Typecheck passes (cargo check)"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Send FlushApprovals signal from approve_mr command",
      "description": "As a reviewer, I want my approval to reach GitLab immediately so teammates see it without waiting for the next sync cycle.",
      "acceptanceCriteria": [
        "The `approve_mr` Tauri command accepts `SyncHandle` as managed state (in addition to the existing DB pool)",
        "After successfully enqueuing the approve action in the sync queue, `approve_mr` sends a `FlushApprovals` command via the SyncHandle",
        "The flush signal is fire-and-forget — the command still returns immediately to the frontend without waiting for the flush to complete",
        "If sending the flush signal fails (e.g., channel closed), the error is logged but does not propagate to the frontend",
        "The `approve_mr` command signature is updated in lib.rs generate_handler registration",
        "Typecheck passes (cargo check)"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Send FlushApprovals signal from unapprove_mr command",
      "description": "As a reviewer, I want my unapproval to reach GitLab immediately so teammates see the updated status without delay.",
      "acceptanceCriteria": [
        "The `unapprove_mr` Tauri command accepts `SyncHandle` as managed state (in addition to the existing DB pool)",
        "After successfully enqueuing the unapprove action in the sync queue, `unapprove_mr` sends a `FlushApprovals` command via the SyncHandle",
        "The flush signal is fire-and-forget — the command still returns immediately to the frontend",
        "If sending the flush signal fails, the error is logged but does not propagate to the frontend",
        "The `unapprove_mr` command signature is updated in lib.rs generate_handler registration",
        "Typecheck passes (cargo check)"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Handle flush failure with existing retry logic",
      "description": "As the system, if the immediate flush to GitLab fails, the action should remain in the queue for the regular sync cycle to retry.",
      "acceptanceCriteria": [
        "If an approval action fails during the immediate flush (network error, 5xx, etc.), the action stays in the sync queue with status 'pending' or 'failed' per existing retry logic",
        "The failure does not block or crash the sync engine — it continues processing remaining approval actions if any",
        "Failed actions will be retried during the next regular 5-minute sync cycle (existing behavior unchanged)",
        "No new error UI, toast, or frontend notification is shown for immediate flush failures",
        "Typecheck passes (cargo check)"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    }
  ]
}
