{
  "project": "Ultra GitLab",
  "branchName": "ralph/token-management",
  "description": "Token Management & Lifetime Display - Allow users to change their GitLab personal access token inline on the Settings page and display token expiration with warning badges",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add GitLab API method to fetch token expiration",
      "description": "As a developer, I need a backend method to retrieve the current token's expiration date from GitLab so the frontend can display lifetime information.",
      "acceptanceCriteria": [
        "New method on GitLabClient that calls GET /personal_access_tokens/self and returns expires_at (date string or null), name, scopes, and active status",
        "Response struct PersonalAccessTokenInfo with fields: expires_at (Option<String>), name (String), scopes (Vec<String>), active (bool)",
        "Handles tokens with no expiration gracefully (returns None for expires_at)",
        "Typecheck passes (cargo check)"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Expose token info via Tauri command",
      "description": "As a developer, I need a Tauri IPC command that the frontend can call to get token lifetime info for a given instance.",
      "acceptanceCriteria": [
        "New Tauri command get_token_info(instance_id) that loads the instance from the DB, creates a GitLabClient, and fetches the token info",
        "Returns a typed response with expires_at: Option<String>, name: String, scopes: Vec<String>, active: bool",
        "Returns a clear error if the instance has no token or the API call fails",
        "Command is registered in the Tauri command handler in main.rs or lib.rs",
        "Typecheck passes (cargo check)"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Add update_instance_token Tauri command",
      "description": "As a developer, I need a backend command that validates a new token against the GitLab API and updates the database row for the instance.",
      "acceptanceCriteria": [
        "New Tauri command update_instance_token(instance_id, token) that validates the token via GitLab GET /user endpoint",
        "On successful validation, updates the token column in the gitlab_instances table for the given instance_id",
        "Returns the validated username on success",
        "Returns a clear error message on validation failure (e.g. 401 Unauthorized)",
        "Command is registered in the Tauri command handler",
        "Typecheck passes (cargo check)"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Add frontend invoke wrappers for new commands",
      "description": "As a developer, I need typed TypeScript wrapper functions for the new Tauri commands so the frontend can call them with type safety.",
      "acceptanceCriteria": [
        "TypeScript function getTokenInfo(instanceId: number) that invokes get_token_info and returns typed TokenInfo response",
        "TypeScript function updateInstanceToken(instanceId: number, token: string) that invokes update_instance_token and returns the username",
        "TokenInfo TypeScript interface with expiresAt: string | null, name: string, scopes: string[], active: boolean",
        "Functions are added to the existing services/tauri.ts or equivalent file",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Add inline Edit Token UI on Settings page",
      "description": "As a user, I want an Edit Token button next to each GitLab instance in Settings so I can update my PAT without removing and re-adding the instance.",
      "acceptanceCriteria": [
        "Each instance item in the Settings list shows an Edit Token button",
        "Clicking it reveals an inline password input field (type=password, placeholder glpat-...) that is auto-focused",
        "Save and Cancel buttons appear next to the input",
        "Cancel hides the input and restores the previous view",
        "Save calls updateInstanceToken and shows a Validating... loading state on the button",
        "On success, shows brief confirmation message and collapses the edit input",
        "On failure, shows an inline error message (e.g. Invalid token) without closing the edit input",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Display token lifetime on each instance",
      "description": "As a user, I want to see when my token expires and how many days are left so I can plan ahead.",
      "acceptanceCriteria": [
        "Each instance item shows expiration info below existing metadata (e.g. Expires Mar 15, 2026 — 38 days left)",
        "If the token has no expiration, shows No expiration",
        "If the token info cannot be fetched, shows nothing or a subtle Unable to fetch token info note",
        "Token info is fetched for all instances in parallel when the Settings page mounts",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Show expiration warning badges",
      "description": "As a user, I want a visual warning when my token expires within 30 days so I notice before it breaks.",
      "acceptanceCriteria": [
        "When a token expires in less than 30 days, show a yellow warning badge with text Expiring soon",
        "When a token is already expired, show a red badge with text Expired",
        "Badges appear next to the expiration text in the instance list",
        "No badge shown when token has more than 30 days remaining or no expiration set",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": true,
      "notes": ""
    }
  ]
}
