{
  "project": "Ultra GitLab",
  "branchName": "ralph/pipeline-logs",
  "description": "Pipeline Job Log Viewer - View and stream job logs with ANSI color rendering and follow mode on a dedicated full-page view",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add Rust command and GitLab client method to fetch job trace",
      "description": "As a developer, I need a backend command that fetches the raw log output for a job from GitLab's API so the frontend can display it.",
      "acceptanceCriteria": [
        "Add `get_job_trace` method to GitLabClient in src-tauri/src/services/gitlab_client.rs that calls GET /projects/:id/jobs/:job_id/trace and returns the raw text body as String",
        "Handle 404 responses gracefully by returning an empty string",
        "Add `get_job_trace` Tauri command in src-tauri/src/commands/pipeline.rs taking instance_id, project_id, job_id and returning String",
        "Re-export the command in src-tauri/src/commands/mod.rs",
        "Register the command in src-tauri/src/lib.rs generate_handler!",
        "cargo check passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Add frontend service wrapper for get_job_trace",
      "description": "As a developer, I need the frontend service layer updated so the new command is accessible from React.",
      "acceptanceCriteria": [
        "Add getJobTrace(instanceId: number, projectId: number, jobId: number): Promise<string> function in src/services/tauri.ts wrapping invoke('get_job_trace', ...)",
        "Re-export getJobTrace from src/services/index.ts",
        "bunx tsc --noEmit passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Create JobLogPage with route and navigation from PipelineDetailPage",
      "description": "As a user, I want to click a job on the PipelineDetailPage and navigate to a full-page log view so I can focus on reading the output.",
      "acceptanceCriteria": [
        "New route /pipelines/:projectId/:pipelineId/jobs/:jobId registered in App.tsx",
        "New page component src/pages/JobLogPage.tsx with corresponding src/pages/JobLogPage.css",
        "Clicking a job row on PipelineDetailPage navigates to the job log route, passing instanceId, job name, job status, stage, and duration as URL search params",
        "Page header shows: job name, status badge (reuse status dot + label pattern from PipelineDetailPage), stage, and duration",
        "BackButton component + Escape key returns to the PipelineDetailPage",
        "On page load, fetches the job trace via getJobTrace and displays the raw text in a monospace pre element",
        "Shows a loading spinner while the initial fetch is in progress",
        "Shows an empty state message if the job has no log output",
        "bunx tsc --noEmit passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Add ANSI escape code rendering to log output",
      "description": "As a user, I want to see the job's log output with terminal colors preserved so I can read it as easily as in a real terminal.",
      "acceptanceCriteria": [
        "Install ansi-to-html npm package (bun add ansi-to-html) or implement a lightweight ANSI SGR parser",
        "Parse ANSI escape codes in the log text and render as styled span elements with appropriate colors",
        "Support standard 8-color, 16-color, and 256-color ANSI codes plus bold, dim, italic, underline attributes",
        "Log container uses monospace font on a dark terminal-style background (#1e1e1e or similar from theme)",
        "Strip any ANSI codes that cannot be rendered (e.g., cursor movement) so they don't appear as raw escape text",
        "bunx tsc --noEmit passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Stream logs for running jobs via polling",
      "description": "As a user, I want to watch a running job's log update in real-time so I can monitor build progress live.",
      "acceptanceCriteria": [
        "When job status is running, pending, or created, poll the trace endpoint every 3 seconds",
        "Append only new content by tracking the length of the previously fetched trace and extracting the new suffix",
        "Show a pulsing 'Live' indicator badge in the page header when actively streaming (reuse pipelinePulse animation from PipelineDetailPage.css)",
        "Pause polling when the window is not visible (use document visibilitychange event)",
        "Resume polling when the window regains focus",
        "Poll job status via getPipelineJobs every 10 seconds to detect when the job finishes, then stop log polling and remove the Live badge",
        "bunx tsc --noEmit passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Add follow mode with auto-scroll",
      "description": "As a user, I want the log to auto-scroll to the bottom as new lines appear so I don't have to manually scroll down during a running job.",
      "acceptanceCriteria": [
        "Follow toggle button visible in a sticky toolbar at the top of the log area",
        "Follow is enabled by default when the job is running/pending/created",
        "When follow is ON, the log container auto-scrolls to the bottom on each new content update",
        "When the user manually scrolls up (away from bottom), follow mode automatically disables",
        "When the user scrolls back to the bottom, follow mode re-enables",
        "Follow button visually indicates its current on/off state (e.g., highlighted when active)",
        "bunx tsc --noEmit passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    }
  ]
}
